app/views/albums/_form.html.erb

    <select id='album-band' name="album[band_id]">
      <%= Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"