app/controllers/albums_controller.rb

INSERT INTO "albums" ("band_id", "name", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 4], ["name", "Slanted and Enchanted"], ["year", 1992], ["created_at", "2020-08-03 01:01:30.932764"], ["updated_at", "2020-08-03 01:01:30.932764"]]
---
  def create
    @album = Album.new(album_params)

    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "albums" SET "name" = $1, "year" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["name", "Tommy"], ["year", 1969], ["updated_at", "2020-08-03 01:46:16.377339"], ["id", 2]]
---
  def update
    @album = Album.find_by(id: params[:id])

    if @album.update_attributes(album_params)